{
  "data": {
    "offset": 5,
    "number": 10,
    "available": 885,
    "news": [
      {
        "id": 341848126,
        "title": "Pokemon Black and White fans are back with the remake hopium as Pokemon posts a teaser ahead of its upcoming Presents stream: \"The room is completely black and white\"",
        "text": "Skip to main content\n\nGamesRadar+\n\nGamesRadar+\n\nGamesRadar+ The Games, Movies, TV & Comics You Love\n\nSearch GamesRadar+\n\nView Profile\n\nXbox Series X\n\nNintendo Switch\n\nNintendo Switch 2\n\nTabletop Gaming\n\nToys & Collectibles\n\nRetro Gamer\n\nNewsletters\n\nTotal Film \n\nGaming Magazines\n\nWhy subscribe?\n\nSubscribe from just £3\nTakes you closer to the games, movies and TV you love\nTry a single issue or save on a subscription\nIssues delivered straight to your door or device\n\n From£9.99View\n\nPrime Day Deals\n\nDonkey Kong Bananza\nSwitch 2 stock\n\nRecommended reading\n\nPokemon Legends: Z-A just got an October release date, and we can look forward to another Pokemon Presents stream in July\n\nPokemon Legends Z-A: Everything we know so far about the upcoming Nintendo game\n\nPokemon Scarlet and Violet's free Switch 2 update promises to steal hundreds more hours from me as shiny hunting looks easier than ever with more wild encounters\n\nTabletop Gaming\nPokemon TCG is dropping another split expansion, and resellers are gonna have a field day\n\nPokemon Scarlet and Violet's Switch 2 update footage shows the \"notorious frame drop lake\" running at 60fps, and fans say it might be \"the best possible advertisement\" for the new console\n\nNintendo finally shows gameplay footage of Pokemon Scarlet and Violet on Switch 2, and the frame rate boost is honestly a lot nicer than I expected\n\nPokemon Champions: Everything we know so far\n\nAdventure Games\n\nPokemon Black / White\n\nPokemon Black and White fans are back with the remake hopium as Pokemon posts a teaser ahead of its upcoming Presents stream: \"The room is completely black and white\"\n\nCatherine Lewis \n\n15 July 2025\n\nIs it time to return to Unova?\n\nWhen you purchase through links on our site, we may earn an affiliate commission. Here’s how it works.\n\n(Image credit: The Pokemon Company/Nintendo)\n\nPokemon Presents makes a grand return next week, and Pokemon Black and White fans are convinced that we might finally see remakes of the Unova region RPGs.\n\nPokemon hasn't stated what we can expect from the stream of announcements airing on July 22 – another look at Pokemon Legends: Z-A seems like a solid guess since it's releasing this October, but nostalgic fans are hoping for a little more than that. This September will mark 15 years since Pokemon Black and White first launched in Japan, and some wholeheartedly believe the time might have come for us to return to the RPGs on Switch 2.\nA new teaser for the Pokemon Presents stream was posted to the official Japanese Twitter account today, showing Pikachu looking at a giant screen while standing in front of some audio equipment. It's probably meant to show the little guy preparing for the big stream, but Unova fans have other ideas.\n\nYou may like\n\nPokemon Legends: Z-A just got an October release date, and we can look forward to another Pokemon Presents stream in July\n\nPokemon Legends Z-A: Everything we know so far about the upcoming Nintendo game\n\nPokemon Scarlet and Violet's free Switch 2 update promises to steal hundreds more hours from me as shiny hunting looks easier than ever with more wild encounters\n\n\"The room is completely black and white (I'm totally delusional),\" points out fan account Out of Context Unova, promptly kicking off the hype as others flock to back the idea up.\n\nThe room is completely black and white (I'm totally delusional) https://t.co/jBdHTsExrxJuly 15, 2025\n\n\"No no no, you are right, not only that the Pikachu model looks like the one from the Pokemon Black and White anime opening,\" one speculates, while another agrees: \"You're not delusional. They've been posting about BW a ton lately. It's almost definitely happening.\" One even goes a step further, and suggests that \"the architecture too is Gen 5.\"\nFans aren't wrong, there has been more Unova region posting from Pokemon's official channels lately, but it's worth pointing out that that's more than likely marketing for the new Trading Card Game set, Black Bolt and White Flare. A black and white room for the Presents stream teaser, though? It does seem like that'd be a separate hint, if it's meant to be one at all.\nThis November, it'll have been four years since the release of Sinnoh remakes Pokemon Brilliant Diamond and Shining Pearl. Looking at the series' history (specifically, from FireRed and LeafGreen onwards), we've seen remakes be released anywhere from three to five years after each other, so the gap isn't totally unreasonable right now.\n\nSign up to the GamesRadar+ Newsletter\nWeekly digests, tales from the communities you love, and more\nContact me with news and offers from other Future brandsReceive email from us on behalf of our trusted partners or sponsorsBy submitting your information you agree to the Terms & Conditions and Privacy Policy and are aged 16 or over.\nBlack and White remakes definitely aren't games I'd want to see rushed out, though – the originals (and their sequels) are still some of my favorite RPGs of all time, and I'd want to see them done right. Imagining a HD-2D style Switch 2 remake, though? That's enough to make me want to believe Pokemon is hinting at something, too.\nIn the meantime, be sure to check out our roundup of the best Pokemon games.\n\nSee more Nintendo Switch 2 News\n\nThe Pokemon Company\nPokemon Direct\n\nNintendo Switch 2\nNintendo Switch\n\nCatherine Lewis\n\nSocial Links Navigation\nDeputy News Editor\n\nI'm GamesRadar+'s Deputy News Editor, working alongside the rest of the news team to deliver cool gaming stories that we love. After spending more hours than I can count filling The University of Sheffield's student newspaper with Pokemon and indie game content, and picking up a degree in Journalism Studies, I started my career at GAMINGbible where I worked as a journalist for over a year and a half. I then became TechRadar Gaming's news writer, where I sourced stories and wrote about all sorts of intriguing topics. In my spare time, you're sure to find me on my Nintendo Switch or PS5 playing through story-driven RPGs like Xenoblade Chronicles and Persona 5 Royal, nuzlocking old Pokemon games, or going for a Victory Royale in Fortnite.\n\nYou must confirm your public display name before commenting\n\nPlease logout and then login again, you will then be prompted to enter your display name.\n\nPokemon Legends: Z-A just got an October release date, and we can look forward to another Pokemon Presents stream in July\n\nPokemon Legends Z-A: Everything we know so far about the upcoming Nintendo game\n\nPokemon Scarlet and Violet's free Switch 2 update promises to steal hundreds more hours from me as shiny hunting looks easier than ever with more wild encounters\n\nPokemon TCG is dropping another split expansion, and resellers are gonna have a field day\n\nPokemon Scarlet and Violet's Switch 2 update footage shows the \"notorious frame drop lake\" running at 60fps, and fans say it might be \"the best possible advertisement\" for the new console\n\nNintendo finally shows gameplay footage of Pokemon Scarlet and Violet on Switch 2, and the frame rate boost is honestly a lot nicer than I expected\n\nLatest in Pokemon\n\nPokemon voice actor behind OG rival Gary, Professor Oak, Meowth, and James dies at 71\n\nPokemon's hardest challenge has finally been completed after 15 months and \"easily over 100k\" collective attempts, and it took an absolute monster Crobat to do it\n\nGoogle AI is worse at Pokemon than I was when I was 5 – taking 800 hours to beat the Elite 4 and having a breakdown when its HP got low\n\nAs Donkey Kong Bananza reveals full-blown voice acting, Pokemon fans are wondering when they will be spared from the awkward silences\n\n\"Just all gone\": Pokemon player loses \"20 years worth of data\" when transferring Scarlet save file to Switch 2, and they're apparently not the only one\n\nPokemon makes its funniest in-game event even better with a meme reference hidden in its distribution code: \"This is quite possibly the best special event code in the history of ever\"\n\nLatest in News\n\nMario Kart World's staff would \"go skateboarding or ride their bikes\" during lunch breaks, which explains the wild movement in the Switch 2 racer\n\nThe release date of My Hero Academia's final season has been announced as its creators launch a vote to find the anime's best scene\n\n2025 is a great year for building smaller gaming PCs, and Fractal Design's new Epoch case proves it\n\nNetflix adds one of the greatest thrillers of all time – but I bet you can't sit through its 3 sequels too\n\nSuper Mario 3D All-Stars just got a new update to \"improve gameplay on Nintendo Switch 2,\" so it sure is a shame you can't actually buy it anymore\n\nMafia: The Old Country will be less of an open-world game than Mafia 3 as the devs agree it was too much and didn't fit the series\n\nGAME REVIEWS\nMOVIE REVIEWS\n\nTony Hawk's Pro Skater 3 + 4 review: \"A nostalgic, must-play hit for fans\"\n\nCollege Football 26 review: “Thanks to rivalries and dynasty, this is the greatest show on turf”\n\nMecha Break review: \"This mech battler makes up for lacking customization with a varied roster that lets me live out my Evangelion fantasy\"\n\nDeath Stranding 2: On the Beach review: \"This tarpunk delivery epic is more Metal Gear Solid than ever, for better and worse\"\n\nRematch review: \"As with Rocket League, the just-one-more-game pull is magnetic\"\n\nSuperman review: \"A triumphant reinvention and a promising start for the DCU\"\n\nJurassic World Rebirth Review: \"An unscary sequel that needed a little more time in amber\"\n\nM3GAN 2.0 review: \"A bold sequel with a slightly underwhelming conclusion\"\n\n28 Years Later Review: \"Enough terror, splatter and suspense to satisfy”\n\nPredator: Killer of Killers review: \"Great characters, thrilling action, and gorgeous Arcane-esque animation\"\n\nSquid Game season 3 review: \"A staggeringly excellent final season wraps up one of the greatest Netflix shows ever\"\n\nIronheart review: \"A relic of Marvel's content-at-all-costs era\"\n\nStar Trek: Strange New Worlds season 3 review: \"The show's most assured run of episodes to date\"\n\nDoctor Who season 2, episode 8 spoiler review: 'The Reality War' is \"a mix of the good, the bad, and the truly baffling\"\n\nDoctor Who season 2, episode 7 spoiler review: 'Wish World' is \"an exciting and ambitious\" start to the season finale, with hints of WandaVision\n\nGamesRadar+ is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.\n\nContact Future's experts\n\nTerms and conditions\n\nPrivacy policy\n\nCookies policy\n\nAdvertise with us\n\nReview guidelines\n\nWrite for us\n\nAccessibility Statement\n\nFuture Publishing Limited Quay House, The Ambury,\n\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. \n\nPlease login or signup to comment\n\nPlease wait...",
        "summary": "Is it time to return to Unova?",
        "url": "https://www.gamesradar.com/games/pokemon/pokemon-black-and-white-fans-are-back-with-the-remake-hopium-as-pokemon-posts-a-teaser-ahead-of-its-upcoming-presents-stream-the-room-is-completely-black-and-white/",
        "image": "https://cdn.mos.cms.futurecdn.net/e4rEF4Rp66p2bPUwQNThja.jpg",
        "video": null,
        "publish_date": "2025-07-15 14:29:53",
        "author": "Catherine Lewis",
        "authors": ["Catherine Lewis"],
        "language": "en",
        "source_country": "us",
        "sentiment": 0.224
      },
      {
        "id": 344170690,
        "title": "Pokemon Legends Z-A is making amends for Scarlet and Violet's poor fashion game, though I can't say I'm not concerned about handing a Furfrou over to a Scyther for a trim",
        "text": "Skip to main content\n\nGamesRadar+\n\nGamesRadar+\n\nGamesRadar+ The Games, Movies, TV & Comics You Love\n\nSearch GamesRadar+\n\nView Profile\n\nXbox Series X\n\nNintendo Switch\n\nNintendo Switch 2\n\nTabletop Gaming\n\nToys & Collectibles\n\nRetro Gamer\n\nNewsletters\n\nTotal Film \n\nGaming Magazines\n\nWhy subscribe?\n\nSubscribe from just £3\nTakes you closer to the games, movies and TV you love\nTry a single issue or save on a subscription\nIssues delivered straight to your door or device\n\n From£9.99Subscribe now\n\nThe Fantastic Four: First Steps\nDonkey Kong Bananza\nSwitch 2 Starter Pack\n\nRecommended reading\n\nPokemon Legends Z-A's Mega Dragonite leak finally confirmed, and it's either \"so good\" or the \"worst design for a Mega Evolution Pokemon ever\" depending on who you ask\n\nPokemon Scarlet and Violet's free Switch 2 update promises to steal hundreds more hours from me as shiny hunting looks easier than ever with more wild encounters\n\n12 years later, Pokemon Legends Z-A brings back a \"forgotten, uninteresting character\" from Pokemon X and Y and puts her in charge of one of the coolest new features \n\nNintendo finally shows gameplay footage of Pokemon Scarlet and Violet on Switch 2, and the frame rate boost is honestly a lot nicer than I expected\n\nPokemon Legends: Z-A just got an October release date, and we can look forward to another Pokemon Presents stream in July\n\nPokemon Legends Z-A: Everything we know so far about the upcoming Nintendo game\n\nPokemon Scarlet and Violet's Switch 2 update footage shows the \"notorious frame drop lake\" running at 60fps, and fans say it might be \"the best possible advertisement\" for the new console\n\nAdventure Games\n\nPokemon Legends: Z-A\n\nPokemon Legends Z-A is making amends for Scarlet and Violet's poor fashion game, though I can't say I'm not concerned about handing a Furfrou over to a Scyther for a trim\n\nIain Harris \n\n22 July 2025\n\nPokemon Legends Z-A fixes my biggest Scarlet and Violet bugbear\n\nWhen you purchase through links on our site, we may earn an affiliate commission. Here’s how it works.\n\n(Image credit: The Pokemon Company)\n\nThe Pokemon Company has shown off more of Pokemon Legends Z-A's customization features in a new stream, and dare I say, it's left a bigger impression on me than both Pikachu's best attempt at a DJ set and the long-awaited confirmation of a Mega Dragonite leak.\n\nFirst, some background. I'm a real dress-up sicko – the true endgame is the fashion game, and all of that – and, while Pokemon did take the logical step by adding trainer customization years back, it's been a tad Onix-acceptable of late.\nPokemon Scarlet and Violet let you change your hairstyle, but aside from that, you're largely stuck with various sets of school uniforms – though you can change the odd bit, like your shoes and socks.\n\nYou may like\n\nPokemon Legends Z-A's Mega Dragonite leak finally confirmed, and it's either \"so good\" or the \"worst design for a Mega Evolution Pokemon ever\" depending on who you ask\n\nPokemon Scarlet and Violet's free Switch 2 update promises to steal hundreds more hours from me as shiny hunting looks easier than ever with more wild encounters\n\n12 years later, Pokemon Legends Z-A brings back a \"forgotten, uninteresting character\" from Pokemon X and Y and puts her in charge of one of the coolest new features \n\nMake the Most of Your Adventure in Pokémon Legends: Z-A! - YouTube\n\nAll of that is a downgrade from what's come before, so it's neato to see Pokemon Legends: Z-A bring some fashion back. As you can see in the video above, you can change your hairstyle and your outfit alongside the color of it all.\n\nAnd that's not all! Why should your trainer enjoy all the fun? If you team up with a Furfrou, you can pay someone to get their Scyther to give them a trim to match your vibe. I can't say I'm not concerned about handing over a beloved pooch to a Pokemon with big ol' scythes for hands, but the results are undeniable. Just don't think about it too hard.\nElsewhere in today's Pokemon Presents stream, we found out that a Pokemon Legends Z-A Switch 2 bundle is coming October 16, and that a \"forgotten, uninteresting character\" from Pokemon X and Y has got a major glow-up in Pokemon Legends Z-A. Truly a range of revelations.\nA new Pokemon puzzle game got shadow launched during today's Presents stream, and it reminds me of all the iPhone games I used to play as a teenager.\n\nSign up to the GamesRadar+ Newsletter\nWeekly digests, tales from the communities you love, and more\nContact me with news and offers from other Future brandsReceive email from us on behalf of our trusted partners or sponsorsBy submitting your information you agree to the Terms & Conditions and Privacy Policy and are aged 16 or over.\n\nSee more Nintendo Switch 2 News\n\nNintendo Switch 2\n\nIain Harris\n\nSocial Links Navigation\nNews Editor, Games\n\nI joined GamesRadar+ in May 2022 following stints at PCGamesN and PocketGamer.Biz, with some freelance for Kotaku UK, RockPaperShotgun, and VG24/7 thrown in for good measure. When I'm not running the news team on the games side, you'll find me putting News Editor duties to one side to play the hottest JRPG of 20 years ago or pillaging the depths of Final Fantasy 14 for a swanky new cloak – the more colourful, the better.\n\nYou must confirm your public display name before commenting\n\nPlease logout and then login again, you will then be prompted to enter your display name.\n\nPokemon Legends Z-A's Mega Dragonite leak finally confirmed, and it's either \"so good\" or the \"worst design for a Mega Evolution Pokemon ever\" depending on who you ask\n\nPokemon Scarlet and Violet's free Switch 2 update promises to steal hundreds more hours from me as shiny hunting looks easier than ever with more wild encounters\n\n12 years later, Pokemon Legends Z-A brings back a \"forgotten, uninteresting character\" from Pokemon X and Y and puts her in charge of one of the coolest new features \n\nNintendo finally shows gameplay footage of Pokemon Scarlet and Violet on Switch 2, and the frame rate boost is honestly a lot nicer than I expected\n\nPokemon Legends: Z-A just got an October release date, and we can look forward to another Pokemon Presents stream in July\n\nPokemon Legends Z-A: Everything we know so far about the upcoming Nintendo game\n\nLatest in Pokemon\n\n12 years later, Pokemon Legends Z-A brings back a \"forgotten, uninteresting character\" from Pokemon X and Y and puts her in charge of one of the coolest new features \n\nPokemon Legends Z-A's Mega Dragonite leak finally confirmed, and it's either \"so good\" or the \"worst design for a Mega Evolution Pokemon ever\" depending on who you ask\n\nA new Pokemon puzzle game got shadow launched during today's Presents stream, and it reminds me of all the iPhone games I used to play as a teenager\n\nPokemon Presents is having its longest showcase in two years this week, so here's how to watch it\n\nPokemon Black and White fans are back with the remake hopium as Pokemon posts a teaser ahead of its upcoming Presents stream: \"The room is completely black and white\"\n\nPokemon voice actor behind OG rival Gary, Professor Oak, Meowth, and James dies at 71\n\nLatest in News\n\nDune: Awakening falls to \"Mixed\" Steam reviews as hoarders find yet another way to dupe items, Funcom releases a patch to flatten the exploit and promises another ban wave is \"happening already\"\n\nEA drops a Battlefield 6 reveal trailer countdown for July 24: \"Prepare for the ultimate all-out warfare experience\"\n\nLast year’s goriest slasher movie is getting a sequel, with the new horror movie set to begin filming just in time for Halloween\n\nIn some of the year's best Twitch content, Peak devs infiltrate streamer lobbies and possess the unholy plush BingBong: \"Sentient BingBong you are so special to me\"\n\n12 years later, Pokemon Legends Z-A brings back a \"forgotten, uninteresting character\" from Pokemon X and Y and puts her in charge of one of the coolest new features \n\nEveryone's favorite Wonder Woman fancast has joined Sinners star Michael B. Jordan's Thomas Crown Affair remake\n\nGAME REVIEWS\nMOVIE REVIEWS\n\nDonkey Kong Bananza Review: \"Destruction isn't just a flashy gimmick for the Minecraft generation, it's one of the best inventions Nintendo has had in years\"\n\nTony Hawk's Pro Skater 3 + 4 review: \"A nostalgic, must-play hit for fans\"\n\nCollege Football 26 review: “Thanks to rivalries and dynasty, this is the greatest show on turf”\n\nMecha Break review: \"This mech battler makes up for lacking customization with a varied roster that lets me live out my Evangelion fantasy\"\n\nDeath Stranding 2: On the Beach review: \"This tarpunk delivery epic is more Metal Gear Solid than ever, for better and worse\"\n\nSuperman review: \"A triumphant reinvention and a promising start for the DCU\"\n\nJurassic World Rebirth Review: \"An unscary sequel that needed a little more time in amber\"\n\nM3GAN 2.0 review: \"A bold sequel with a slightly underwhelming conclusion\"\n\n28 Years Later Review: \"Enough terror, splatter and suspense to satisfy”\n\nPredator: Killer of Killers review: \"Great characters, thrilling action, and gorgeous Arcane-esque animation\"\n\nSquid Game season 3 review: \"A staggeringly excellent final season wraps up one of the greatest Netflix shows ever\"\n\nIronheart review: \"A relic of Marvel's content-at-all-costs era\"\n\nStar Trek: Strange New Worlds season 3 review: \"The show's most assured run of episodes to date\"\n\nDoctor Who season 2, episode 8 spoiler review: 'The Reality War' is \"a mix of the good, the bad, and the truly baffling\"\n\nDoctor Who season 2, episode 7 spoiler review: 'Wish World' is \"an exciting and ambitious\" start to the season finale, with hints of WandaVision\n\nGamesRadar+ is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.\n\nContact Future's experts\n\nTerms and conditions\n\nPrivacy policy\n\nCookies policy\n\nAdvertise with us\n\nReview guidelines\n\nWrite for us\n\nAccessibility Statement\n\nFuture Publishing Limited Quay House, The Ambury,\n\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. \n\nPlease login or signup to comment\n\nPlease wait...",
        "summary": "Pokemon Legends Z-A fixes my biggest Scarlet and Violet bugbear",
        "url": "https://www.gamesradar.com/games/pokemon/pokemon-legends-z-a-is-making-amends-for-scarlet-and-violets-poor-fashion-game-though-i-cant-say-im-not-concerned-about-handing-a-furfrou-over-to-a-scyther-for-a-trim/",
        "image": "https://cdn.mos.cms.futurecdn.net/jvP4cd8dPD5vYC5fWerM5U.jpg",
        "video": null,
        "publish_date": "2025-07-22 16:31:38",
        "author": "Iain Harris",
        "authors": ["Iain Harris"],
        "language": "en",
        "source_country": "us",
        "sentiment": 0.386
      },
      {
        "id": 343730834,
        "title": "Pokemon Presents is having its longest showcase in two years this week, so here's how to watch it",
        "text": "Skip to main content\n\nGamesRadar+\n\nGamesRadar+\n\nGamesRadar+ The Games, Movies, TV & Comics You Love\n\nSearch GamesRadar+\n\nView Profile\n\nXbox Series X\n\nNintendo Switch\n\nNintendo Switch 2\n\nTabletop Gaming\n\nToys & Collectibles\n\nRetro Gamer\n\nNewsletters\n\nTotal Film \n\nGaming Magazines\n\nWhy subscribe?\n\nSubscribe from just £3\nTakes you closer to the games, movies and TV you love\nTry a single issue or save on a subscription\nIssues delivered straight to your door or device\n\n From£9.99Subscribe now\n\nThe Fantastic Four: First Steps\nDonkey Kong Bananza\nSwitch 2 Starter Pack\n\nRecommended reading\n\nPokemon Legends: Z-A just got an October release date, and we can look forward to another Pokemon Presents stream in July\n\nPokemon Black and White fans are back with the remake hopium as Pokemon posts a teaser ahead of its upcoming Presents stream: \"The room is completely black and white\"\n\nPokemon Legends Z-A: Everything we know so far about the upcoming Nintendo game\n\nAnime Shows\nHow to watch Pokemon in order: a complete guide to the TV show and movies\n\nPlayStation State of Play confirmed for tomorrow with 40+ minutes of \"news and updates on must-play\" PS5 games, right before Summer Game Fest kicks off\n\nAnime Movies\nGotta watch 'em all: The best Pokémon movies from your childhood are available for free on YouTube for a \"limited time\"\n\nPokemon Scarlet and Violet's Switch 2 update footage shows the \"notorious frame drop lake\" running at 60fps, and fans say it might be \"the best possible advertisement\" for the new console\n\nAdventure Games\n\nPokemon Legends: Z-A\n\nPokemon Presents is having its longest showcase in two years this week, so here's how to watch it\n\nScott McCrae \n\n21 July 2025\n\nI wouldn't get my hopes up for Generation 10 though\n\nWhen you purchase through links on our site, we may earn an affiliate commission. Here’s how it works.\n\n(Image credit: The Pokemon Company)\n\nThe Pokemon YouTube channel has revealed the runtime for this week's Pokemon Presents presentation, and its 24-minute runtime makes it the longest in two years.\n\nAlongside the announcement that Pokemon Legends: Z-A will be releasing in October, The Pokemon Company unconventionally announced a Pokemon Presents presentation months in advance. And here we are two months later, with the Pokemon Presents stream set to take place tomorrow, on Tuesday, July 22. As we approach the stream, the runtime of the event has been revealed, and it's a long one.\nAccording to Serebii.net webmaster Joe Merrick, the Pokemon Korea YouTube channel has revealed that the presentation will last 24 minutes, with Merrick providing a runtime rundown of all of the previous presentations going back to June 2020 when it debuted. This 24-minute runtime makes this week's showcase the fourth-longest in history behind February 2023, August 2021, and August 2023, respectively.\n\nYou may like\n\nPokemon Legends: Z-A just got an October release date, and we can look forward to another Pokemon Presents stream in July\n\nPokemon Black and White fans are back with the remake hopium as Pokemon posts a teaser ahead of its upcoming Presents stream: \"The room is completely black and white\"\n\nPokemon Legends Z-A: Everything we know so far about the upcoming Nintendo game\n\nHow to watch the July Pokemon Presents\nYou can watch this week's Pokemon Presents stream through the Pokemon Company's YouTube channel on July 22 at 6am PDT, 9am EDT, 2pm BST, or 3pm CEST.\n\nWhile the showcase will undoubtedly feature a look at Pokemon Legends: Z-A, I wouldn't exactly get my hopes up too much for there to be massive announcements because of this runtime. The longest presentation by almost 10 minutes was the August 23 showcase, but other than a deep dive into the DLC for Pokemon Scarlet & Violet, there really wasn't much to write home about on the mainline game front.\nPokemon Presents covers everything from the anime series, Pokemon Unite, card games, and the countless mobile games, so the lengthy presentation probably doesn't mean we'll get a Generation 10 announcement or classic games on NSO, but we can hope, right?\nPokemon Black and White fans are back with the remake hopium as Pokemon posts a teaser ahead of its upcoming Presents stream: \"The room is completely black and white.\"\n\nSign up to the GamesRadar+ Newsletter\nWeekly digests, tales from the communities you love, and more\nContact me with news and offers from other Future brandsReceive email from us on behalf of our trusted partners or sponsorsBy submitting your information you agree to the Terms & Conditions and Privacy Policy and are aged 16 or over.\n\nSee more Nintendo Switch 2 News\n\nPokemon Direct\nThe Pokemon Company\n\nNintendo Switch 2\n\nScott McCrae\n\nSocial Links Navigation\nContributor\n\nScott has been freelancing for over three years across a number of different gaming publications, first appearing on GamesRadar+ in 2024. He has also written for the likes of PC Gamer, Eurogamer, VG247, Play, TechRadar, and others. He's typically rambling about Metal Gear Solid, God Hand, or any other PS2-era titles that rarely (if ever) get sequels.\n\nYou must confirm your public display name before commenting\n\nPlease logout and then login again, you will then be prompted to enter your display name.\n\nPokemon Legends: Z-A just got an October release date, and we can look forward to another Pokemon Presents stream in July\n\nPokemon Black and White fans are back with the remake hopium as Pokemon posts a teaser ahead of its upcoming Presents stream: \"The room is completely black and white\"\n\nPokemon Legends Z-A: Everything we know so far about the upcoming Nintendo game\n\nHow to watch Pokemon in order: a complete guide to the TV show and movies\n\nPlayStation State of Play confirmed for tomorrow with 40+ minutes of \"news and updates on must-play\" PS5 games, right before Summer Game Fest kicks off\n\nGotta watch 'em all: The best Pokémon movies from your childhood are available for free on YouTube for a \"limited time\"\n\nLatest in Pokemon\n\nPokemon Black and White fans are back with the remake hopium as Pokemon posts a teaser ahead of its upcoming Presents stream: \"The room is completely black and white\"\n\nPokemon voice actor behind OG rival Gary, Professor Oak, Meowth, and James dies at 71\n\nPokemon's hardest challenge has finally been completed after 15 months and \"easily over 100k\" collective attempts, and it took an absolute monster Crobat to do it\n\nGoogle AI is worse at Pokemon than I was when I was 5 – taking 800 hours to beat the Elite 4 and having a breakdown when its HP got low\n\nAs Donkey Kong Bananza reveals full-blown voice acting, Pokemon fans are wondering when they will be spared from the awkward silences\n\n\"Just all gone\": Pokemon player loses \"20 years worth of data\" when transferring Scarlet save file to Switch 2, and they're apparently not the only one\n\nLatest in News\n\nGhost of Yotei has a \"similar\" time commitment to Ghost of Tsushima, and another 25-hour open-world RPG sounds heavenly to my swelling backlog\n\nStranger Things showrunner debunks that 3-hour finale runtime rumor post: \"Not even close to accurate\"\n\nDespite Oscar wins and making over $30 billion at the box office, MCU boss Kevin Feige has \"never been satisfied\" with any Marvel movie he's released\n\n37 movies into the MCU, Marvel boss Kevin Feige says Fantastic Four is their \"first standalone\" film: \"There's no homework required\"\n\nUbisoft CEO Yves Guillemot blames Star Wars Outlaws' missed sales targets on Star Wars itself being in \"choppy waters,\" but hopes further improvements and a Switch 2 launch can revive the open-world game\n\nAvengers: Secret Wars will \"reset\" the MCU into a \"singular timeline,\" but Kevin Feige says it's not quite a reboot: \"Reboot is a scary word\" \n\nGAME REVIEWS\nMOVIE REVIEWS\n\nDonkey Kong Bananza Review: \"Destruction isn't just a flashy gimmick for the Minecraft generation, it's one of the best inventions Nintendo has had in years\"\n\nTony Hawk's Pro Skater 3 + 4 review: \"A nostalgic, must-play hit for fans\"\n\nCollege Football 26 review: “Thanks to rivalries and dynasty, this is the greatest show on turf”\n\nMecha Break review: \"This mech battler makes up for lacking customization with a varied roster that lets me live out my Evangelion fantasy\"\n\nDeath Stranding 2: On the Beach review: \"This tarpunk delivery epic is more Metal Gear Solid than ever, for better and worse\"\n\nSuperman review: \"A triumphant reinvention and a promising start for the DCU\"\n\nJurassic World Rebirth Review: \"An unscary sequel that needed a little more time in amber\"\n\nM3GAN 2.0 review: \"A bold sequel with a slightly underwhelming conclusion\"\n\n28 Years Later Review: \"Enough terror, splatter and suspense to satisfy”\n\nPredator: Killer of Killers review: \"Great characters, thrilling action, and gorgeous Arcane-esque animation\"\n\nSquid Game season 3 review: \"A staggeringly excellent final season wraps up one of the greatest Netflix shows ever\"\n\nIronheart review: \"A relic of Marvel's content-at-all-costs era\"\n\nStar Trek: Strange New Worlds season 3 review: \"The show's most assured run of episodes to date\"\n\nDoctor Who season 2, episode 8 spoiler review: 'The Reality War' is \"a mix of the good, the bad, and the truly baffling\"\n\nDoctor Who season 2, episode 7 spoiler review: 'Wish World' is \"an exciting and ambitious\" start to the season finale, with hints of WandaVision\n\nGamesRadar+ is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.\n\nContact Future's experts\n\nTerms and conditions\n\nPrivacy policy\n\nCookies policy\n\nAdvertise with us\n\nReview guidelines\n\nWrite for us\n\nAccessibility Statement\n\nFuture Publishing Limited Quay House, The Ambury,\n\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. \n\nPlease login or signup to comment\n\nPlease wait...",
        "summary": "I wouldn't get my hopes up for Generation 10 though",
        "url": "https://www.gamesradar.com/games/pokemon/pokemon-presents-is-having-its-longest-showcase-in-two-years-this-week-heres-how-to-watch-it/",
        "image": "https://cdn.mos.cms.futurecdn.net/Jc5peirCbmncDNyQHLhyCT.png",
        "video": null,
        "publish_date": "2025-07-21 11:33:29",
        "author": "Scott McCrae",
        "authors": ["Scott McCrae"],
        "language": "en",
        "source_country": "us",
        "sentiment": 0.079
      },
      {
        "id": 344289272,
        "title": "Here's everything announced in today's Pokémon Presents showcase",
        "text": "DJ Pikachu has been and gone, taking the latest Pokémon Direct (or Pokémon Presents if you must) with him. And this time around, we got Pokénews aplenty, with small furry fistfuls of new Z-A details, some Pokémon Go updates, a new Pokémon puzzler, and more. But if you missed it - or simply need a refresher - you'll find everything announced below.\n\nA quick bit on this year's Pokémon World Championships\n\n\nFirst up, a reminder that the Pokémon World Championships are coming to Anaheim, California this year. They're running from 15th-17th August, with competitors set to do battle across the likes of Pokémon Violet and Scarlet, the Pokémon Trading Card Game, Pokémon Go, and Pokémon Unite. All competitors get a \"celebratory\" promo card, so hooray. There're more details over on the Pokémon website.\n\nHere's a look at Pokémon Concierge's upcoming new episodes\n\n\nPokémon Concierge - Netflix's gorgeously animated and well-received TV spin-off - is returning to the streaming service with more episodes, and we got an eye-catching trailer to remind us of that. Better yet, there's an air date for the new episodes, which we now know will be available from 4th September.\n\nWallace and Gromit animation studio is making a Pokémon show\n\n\nAardman Animation, the studio behind the much-loved Wallace and Gromit series, is working on a new stop-motion Pokémon TV show. It promises a unique look at the Pokémon world, told from the critters' perspective, all presented using the \"signature Aardman sense of character and comedy and craft\". It's called Pokémon Tales: The Misadventures of Sirfetch and Pichu and - as you can see in its teaser trailer above - looks delightful. This one's due to arrive in 2027.\n\nA quick peek at Japan's PokéPark Kanto theme park attraction\n\n\nPokéPark Kanto - the first \"permanent outdoor Pokémon attraction\" - is opening within Japan's Yomiuriland amusement park \"soon\" and we got a little taste of the activities visitors can enjoy should they find themselves within its walls. It's divided into two area, Sedge Town and the Pokémon Forest. In the forest, visitors can see various Pokémon interacting with each other, while the town is an area where Pokémon and Trainers gather. It's opening in 2026, with tickets set to go on sale later this year.\n\nHere's what to expect from the Pokémon Go Fest 2025: Max Finale\n\n\nNext, a bit of news about Pokémon Go Fest 2025: Max Finale, which runs from 23rd-24th August, heralding back-to-back appearances from various Max Pokémon, and an opportunity for players to encounter Eternatus globally for the first time. There's also a promo code - GOFESTMAX - you can enter on the website for a chance of catching a Gigantamax Pokémon.\n\nA quick round-up of everything going on in Pokémon's mobile spin-offs\n\n\nAnd in other mobile news, Pokémon Masters EX will see Carmine & Sinistcha appear in their featured Poké Fair from 29th July to 6th September, while Lapra - in its five-star sea captain outfit - is set to appear in Pokémon Café Remix starting 23rd July until 21st August. Sea adventure-themed decorations are also being added to café customisation soon, with Alolan Mouth, Totodile, and Minccino also on the way in special crew-themed outfits \"one after another\".\n\n\nOver in Pokémon Sleep, players can research Raikou, Entei, and Suicune this September, and a new area - Amber Canyon - arrives in November. As for Pokémon Unite, Latios joins on 18th July and Latias arrives on 8th August, all to commemorate the games fourth anniversary. \n\nAnd a sentence about the Pokémon Trading Card Game\n\n\nPokémon Trading Card Game: Mega Evolution releases Friday, 26th September. There you go.\n\nPokémon Friends revealed and out today\n\n\nAnd if that's not enough spin-off games to be getting on with, there's now Pokémon Friends, a Pokémon-themed mini-game puzzler featuring sliding blocks, rotating tracks, and more. Solving puzzles unlocks digital plushies you can use to decorate your in-game \"plush room\", and it's available today on Switch, iOS and Android. \n\nSome Pokémon Violet and Scarlet news, including more Tera Raids\n\n\nAfter a quick reminder Pokémon Violet and Scarlet now have a Switch 2 update improving framerate and resolution, we got the news a fresh Tera Raid battle event starts tomorrow, 23rd July, featuring shiny versions of Wo-Chien, Chien-Pao, Ting-Lu, and Chi-Yu, with each being available for one week starting 23rd July and ending 14th September. However, just completing a battle isn't enough to secure the Pokémon - you can only add them to your team after they've been defeated 1m times by the community. Various weekly Pokémon Mass Outbreak events are set to run concurrently, and there's also a tracksuit apparel item you can acquire by entering the code STRACKSU1T or VTRACKSU1T into Scarlet and Violet respectively.\n\nAnother look at Pokémon Champions\n\n\nThe previously announced Pokémon Champions, which lets players battle each other in an arena using new or previous Pokémon Partners (you'll need to use Pokémon Home in order to access the latter), got another airing during today's showcase, offering a look at battling, the newly revealed training feature, and more. There's still no release date for Pokémon Champions yet, but it's coming to Switch, iOS, and Android next year.\n\nAnd lastly, Pokémon Z-A returns with fresh details\n\n\nAnd finally, the big one: Pokémon Z-A. GameFreak had plenty to say on its latest mainline Pokémon entry - here seen running on Switch 2 - including a look at Lumiose City, its story, Z-A Royale battles, side activities (including character customisation and customisable Furfrous), plus photo mode. You can read more on Z-A's latest showing - including details on Rogue Mega Evolved Pokémon - elsewhere on Eurogamer. If you want to know what Pokés will be making an appearance, check out our returning Pokémon list. It's out 16th October, alongside a Switch 2 bundle, and that, I'm afraid, is the end of today's news.",
        "summary": "DJ Pikachu has been and gone, taking the latest Pok&eacute;mon Direct (or Pok&eacute;mon Presents if you must) with him. And this time around, we got Pok&eacute;news aplenty, with small furry fistfuls of new Z-A details, some Pok&eacute;mon Go updates, a new Pok&eacute;mon puzzler, and more. But if you missed it - or simply need a refresher - you'll find everything announced below.\n\n\n Read more",
        "url": "https://www.eurogamer.net/heres-everything-announced-in-todays-pokemon-presents-showcase",
        "image": "https://assetsio.gnwcdn.com/DJ-Pikachu-%E2%80%93-Full-Set-36-37-screenshot.png?width=1200&height=1200&fit=crop&quality=100&format=png&enable=upscale&auto=webp",
        "video": null,
        "publish_date": "2025-07-22 14:24:52",
        "author": "Matt Wales",
        "authors": ["Matt Wales"],
        "language": "en",
        "category": "politics",
        "source_country": "us",
        "sentiment": 0.529
      },
      {
        "id": 344875346,
        "title": "Mega Dragonite's goofy wings in Pokemon Legends Z-A start to make sense when you consider one of the wildest theories in Pokemon history: \"All the Mega Pokemon are designed after either the letter X or Y\"",
        "text": "Skip to main content\n\nGamesRadar+\n\nGamesRadar+\n\nGamesRadar+ The Games, Movies, TV & Comics You Love\n\nSearch GamesRadar+\n\nView Profile\n\nXbox Series X\n\nNintendo Switch\n\nNintendo Switch 2\n\nTabletop Gaming\n\nToys & Collectibles\n\nRetro Gamer\n\nNewsletters\n\nTotal Film \n\nGaming Magazines\n\nWhy subscribe?\n\nSubscribe from just £3\nTakes you closer to the games, movies and TV you love\nTry a single issue or save on a subscription\nIssues delivered straight to your door or device\n\n From$12Subscribe now\n\nSDCC 2025 schedule\n\nThe Fantastic Four: First Steps\nSwitch 2 Starter Pack\n\nRecommended reading\n\nPokemon Legends Z-A's Mega Dragonite leak finally confirmed, and it's either \"so good\" or the \"worst design for a Mega Evolution Pokemon ever\" depending on who you ask\n\nPokemon Legends Z-A is making amends for Scarlet and Violet's poor fashion game, though I can't say I'm not concerned about handing a Furfrou over to a Scyther for a trim\n\n12 years later, Pokemon Legends Z-A brings back a \"forgotten, uninteresting character\" from Pokemon X and Y and puts her in charge of one of the coolest new features \n\nPokemon logo designer speaks up after 27 years, shares unused designs and says Nintendo gave him a month to draft one of the most iconic logos in history before Red and Blue reveal\n\nPokemon Legends Z-A: Everything we know so far about the upcoming Nintendo game\n\nPokemon Legends: Z-A seemingly features a returning X and Y character who has fans going feral after spotting her in the RPG's cover art\n\nAction RPGs\n\"I bet they didn't crunch this in a year or 2\": As Switch 2 gives Pokemon Scarlet and Violet a needed FPS boost, fans blast GameFreak one last time as it unveils its gorgeous new action RPG\n\nAdventure Games\n\nPokemon Legends: Z-A\n\nMega Dragonite's goofy wings in Pokemon Legends Z-A start to make sense when you consider one of the wildest theories in Pokemon history: \"All the Mega Pokemon are designed after either the letter X or Y\"\n\nIssy van der Velde \n\n24 July 2025\n\nYou have to squint at some of them but it does make a lot of sense\n\nWhen you purchase through links on our site, we may earn an affiliate commission. Here’s how it works.\n\n(Image credit: The Pokemon Company/Nintendo)\n\nDid anybody else know that Pokemon's Mega Evolutions are supposedly designed to look like the letters X or Y? And if you all did know, why did nobody tell me?\n\nThe new Mega Dragonite reveal for Pokemon Legends Z-A caused a five-month-old post on Bluesky to resurface. It reads: \"It's crazy that after a over decade so many people still don't realize all the Mega Pokemon are designed after either the letter X or Y.\"\nThe pictures of Mega Metagross, Slowbro, Abomasnow, and Absol really do look like X, Y, X, and Y, respectively. I imagine if you just took their silhouettes, you'd see it better.\n\nYou may like\n\nPokemon Legends Z-A's Mega Dragonite leak finally confirmed, and it's either \"so good\" or the \"worst design for a Mega Evolution Pokemon ever\" depending on who you ask\n\nPokemon Legends Z-A is making amends for Scarlet and Violet's poor fashion game, though I can't say I'm not concerned about handing a Furfrou over to a Scyther for a trim\n\n12 years later, Pokemon Legends Z-A brings back a \"forgotten, uninteresting character\" from Pokemon X and Y and puts her in charge of one of the coolest new features \n\nI had to check out the rest of the Mega Pokemon and see how many fit this design. I've found that some are definitely clearer examples than others. Mega Scizor is an X. With its splayed stance and outstretched metal claws, I can totally see it. Mega Aerodactyl is more of a Y, with its large wingspan becoming the branches of the letter and its thin body being the stem.\n\nMega Gengar is also an X, with its arms glued to the floor and ears forming the shape. But then you get a 'mon like Mega Heracross, and I simply don't know how I'm supposed to analyse it. I guess with its wings out it could be an X, and with them in, if you squint and turn it upside down, it could be a Y.\nSome of them have X or Y incorporated into their design in different ways, such as Mega Lopunny having an X on its forehead and Mega Lucario's chest glowing to form an X. Also, Sharpedo is covered in marks that look like the letter X.\nConsidering this, if you look at Mega Dragonite again and consider the wings on its head, which form a Y shape, the whole design makes a lot more sense. It's pretty cool considering this mechanic was introduced in Pokemon X and Y.\n\nSign up to the GamesRadar+ Newsletter\nWeekly digests, tales from the communities you love, and more\nContact me with news and offers from other Future brandsReceive email from us on behalf of our trusted partners or sponsorsBy submitting your information you agree to the Terms & Conditions and Privacy Policy and are aged 16 or over.\nI'm glad we're getting more Mega 'mons – I just hope Game Freak is brave enough to also turn Chikorita into a Dinosaur-type.\nIn the meantime, check out our ranking of the best Pokemon games.\n\nSee more Nintendo Switch 2 News\n\nNintendo Switch 2\n\nIssy van der Velde\n\nSocial Links Navigation\nContributor\n\nI'm Issy, a freelancer who you'll now occasionally see over here covering news on GamesRadar. I've always had a passion for playing games, but I learned how to write about them while doing my Film and TV degrees at the University of Warwick and contributing to the student paper, The Boar. After university I worked at TheGamer before heading up the news section at Dot Esports. Now you'll find me freelancing for Rolling Stone, NME, Inverse, and many more places. I love all things horror, narrative-driven, and indie, and I mainly play on my PS5. I'm currently clearing my backlog and loving Dishonored 2.\n\nYou must confirm your public display name before commenting\n\nPlease logout and then login again, you will then be prompted to enter your display name.\n\nPokemon Legends Z-A's Mega Dragonite leak finally confirmed, and it's either \"so good\" or the \"worst design for a Mega Evolution Pokemon ever\" depending on who you ask\n\nPokemon Legends Z-A is making amends for Scarlet and Violet's poor fashion game, though I can't say I'm not concerned about handing a Furfrou over to a Scyther for a trim\n\n12 years later, Pokemon Legends Z-A brings back a \"forgotten, uninteresting character\" from Pokemon X and Y and puts her in charge of one of the coolest new features \n\nPokemon logo designer speaks up after 27 years, shares unused designs and says Nintendo gave him a month to draft one of the most iconic logos in history before Red and Blue reveal\n\nPokemon Legends Z-A: Everything we know so far about the upcoming Nintendo game\n\nPokemon Legends: Z-A seemingly features a returning X and Y character who has fans going feral after spotting her in the RPG's cover art\n\nLatest in Pokemon\n\nAll Pokemon Presents 2025 Codes for Pokemon Go, Scarlet and Violet, and Legends Z-A\n\nPokemon Champions is the Pokemon Stadium 3 we deserve, and it's out in 2026\n\nPokemon Legends Z-A is making amends for Scarlet and Violet's poor fashion game, though I can't say I'm not concerned about handing a Furfrou over to a Scyther for a trim\n\n12 years later, Pokemon Legends Z-A brings back a \"forgotten, uninteresting character\" from Pokemon X and Y and puts her in charge of one of the coolest new features \n\nPokemon Legends Z-A's Mega Dragonite leak finally confirmed, and it's either \"so good\" or the \"worst design for a Mega Evolution Pokemon ever\" depending on who you ask\n\nA new Pokemon puzzle game got shadow launched during today's Presents stream, and it reminds me of all the iPhone games I used to play as a teenager\n\nLatest in News\n\nThe first look at Ezra Bridger in Ahsoka season 2 has hit the internet from SDCC, and Star Wars fans think he looks perfect: \"They cast Ezra so perfectly for live-action\"\n\n\"I can't believe I just beat Minecraft in an Overwatch queue\": Streamer beats Minecraft while in a 2-hour wait, putting my procrastination to shame\n\nRematch's first big patch makes being a goalkeeper even more terrifying, because improved hit detection means I'm being mobbed on every goal kick\n\nHytale co-founder replies to their own \"no risk, no story\" tweet, and fans haven't known peace since: \"This is either the biggest comeback in the gaming industry or the biggest troll ever\"\n\nFive Nights at Freddy's 2 trailer sees new animatronics arrive – and start stalking fresh victims \n\n\"So much of DOOM’s soul is down to heavy metal\": FPS legend John Romero says \"without Ozzy and Black Sabbath, I am not sure it would have been the same\"\n\nGAME REVIEWS\nMOVIE REVIEWS\n\nWheel World review: \"By merging Burnout Paradise and The Legend of Zelda: Breath of the Wild with pedal power, Wheel World arrives somewhere unusual and worth visiting\"\n\nWuchang: Fallen Feathers review: \"Flashy combos are impressive, but boss battle frustrations get in the way of me actually using them\"\n\nDonkey Kong Bananza Review: \"Destruction isn't just a flashy gimmick for the Minecraft generation, it's one of the best inventions Nintendo has had in years\"\n\nTony Hawk's Pro Skater 3 + 4 review: \"A nostalgic, must-play hit for fans\"\n\nCollege Football 26 review: “Thanks to rivalries and dynasty, this is the greatest show on turf”\n\nThe Fantastic Four: First Steps review: \"An occasionally thrilling heroic adventure that sits safely within a B-tier MCU range\"\n\nSuperman review: \"A triumphant reinvention and a promising start for the DCU\"\n\nJurassic World Rebirth Review: \"An unscary sequel that needed a little more time in amber\"\n\nM3GAN 2.0 review: \"A bold sequel with a slightly underwhelming conclusion\"\n\n28 Years Later Review: \"Enough terror, splatter and suspense to satisfy”\n\nSquid Game season 3 review: \"A staggeringly excellent final season wraps up one of the greatest Netflix shows ever\"\n\nIronheart review: \"A relic of Marvel's content-at-all-costs era\"\n\nStar Trek: Strange New Worlds season 3 review: \"The show's most assured run of episodes to date\"\n\nDoctor Who season 2, episode 8 spoiler review: 'The Reality War' is \"a mix of the good, the bad, and the truly baffling\"\n\nDoctor Who season 2, episode 7 spoiler review: 'Wish World' is \"an exciting and ambitious\" start to the season finale, with hints of WandaVision\n\nGamesRadar+ is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site.\n\nContact Future's experts\n\nTerms and conditions\n\nPrivacy policy\n\nCookies policy\n\nAdvertise with us\n\nReview guidelines\n\nWrite for us\n\nAccessibility Statement\n\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\n\nPlease login or signup to comment\n\nPlease wait...",
        "summary": "You have to squint at some of them but it does make a lot of sense",
        "url": "https://www.gamesradar.com/games/pokemon/mega-dragonites-goofy-wings-in-pokemon-legends-z-a-start-to-make-sense-when-you-consider-one-of-the-wildest-theories-in-pokemon-history-all-the-mega-pokemon-are-designed-after-either-the-letter-x-or-y/",
        "image": "https://cdn.mos.cms.futurecdn.net/GyonEvSWow4wzZubNDAZdf.jpg",
        "video": null,
        "publish_date": "2025-07-24 14:53:02",
        "author": "Issy van der Velde",
        "authors": ["Issy van der Velde"],
        "language": "en",
        "source_country": "us",
        "sentiment": -0.035
      },
      {
        "id": 344200932,
        "title": "Everything Announced During Today's Pokémon Presents, From Legends Z-A To Champions And More",
        "text": "The Pokémon Company held another Pokémon Presents direct-style presentation today, featuring new looks at upcoming games like Pokémon Legends: Z-A and Pokémon Champions, and brand-new game reveals, too. Clocking it at roughly 24 minutes, it's one of the longest Pokémon Presents ever, and there's a lot to unpack...so let's get right into it!\n\nEverything Announced During The July 2025 Pokémon Presents\n\n2025 Pokémon World Championships\n\nToday's Pokémon Presents began with a quick look at what to expect during the 2025 Pokémon World Championships happening next month in Anaheim, California, including details about where it will be streaming and more. Head here for a more information about that. We learned during this segment that all competitors will receive the promotional card show above: \n\nPokémon Concierge Season 2\n\nAhead of the release of Pokémon Concierge Season 2 (or at least, the next batch of episodes), The Pokémon Company and Netflix released a new look, and you can check it out in the trailer below. There's plenty of new Pokémon, like Sealeo, characters, like Haru's ex-boyfriend, and of course, lots of gorgeous animation. This new batch of Pokémon Concierge episodes hits Netflix on September 4. \n\nPokémon Tales: The Misadventures of Sirfetch'd & Pichu\n\nNot only did we get our first look at what Wallace & Gromit studio Aardman Animations is cooking up with its upcoming Pokémon series, we also got the official title for the show: Pokémon Tales: The Misadventures of Sirfetch'd & Pichu. It debuts sometime in 2027. Check it out in the trailer below: \n\nPokéPark Kanto\n\nWe knew PokéPark Kanto, a Pokémon theme park of sorts, was coming to Japan sometime in the future. Now, we know it will be stretched across 26,000 square meters of Tokyo's verdant Tama Hills, tucked into a corner of Yomiuriland. It is the first-ever permanent outdoor Pokémon attraction, and will hold its grand opening next year. Advance ticket sales are expected to begin later this year. \n\nIt will consist of two sections: Sedge Town and Pokémon Forest (pictured above), and you can expect trainers and Pokémon encounters within each. \n\nPokémon Go: Max Finale 2025\n\nThe Pokémon GO Fest 2025: Max Finale is coming soon and will run from August 23 to August 24. It will feature Eternatus for the first time ever globally, and you can use the promo code GOFESTMAX for bonus goodies right now. \n\nPokémon Cafe ReMix\n\nSummer has arrived in Pokémon Café ReMix, bringing all sorts of pirate-themed and nautical fun to the game. You can meet Lapras in its five-star Sea Captain outfit, starting July 23, and expect even more members of their crew to appear later, too. Customize your café with nautical, sea-themed decorations soon, and on July 23, discover Alolan Meowth, Totodile, and Minccino one after another in their special crew-themed outfits. Login today to recruit Jigglypuff in its summer fun outfit to your staff. \n\nPokémon Sleep\n\nStarting this September, you can research the legendary Johto dog Pokémon – Raikou, Entei, and Suicune – while you sleep using Pokémon Sleep. \n\nPokémon Unite\n\nTo celebrate four years of Pokémon Unite, the legendary Hoenn Pokémon – Latias and Latios – are joining the fight. Latios hit the game on July 18, and Latios will join the roster next month on August 8. \n\nPokémon Trading Card Game\n\nMega evolution comes to the Pokémon Trading Card Game in a big way in the upcoming Mega Evolution expansion set. It begins on September 26, and will feature EX cards and more for Mega Pokémon like Lucario, Kangaskhan, Venasaur, and Gardevoir. Take a sneak peak at some of them in the gallery below: \n\nPokémon Friends\n\nPokémon Friends is a new puzzle game available today on Nintendo Switch, iOS, and Android devices. The mobile versions of the game are free, but the Switch version costs $9.99. You can read more details about the game, including what to expect and information about the price and its DLC, in our story here. \n\nPokémon Scarlet and Violet\n\nAfter the free Nintendo Switch 2 update for Generation 9 of Pokémon launched last month, theses games are much more playable, with increased resolution and draw distance, a pretty stable 60 FPS framerate, and more. Now, players can expect a new Tera Raid Battle event series to begin. The first series begins tomorrow, and the entire series will wrap up in September. You can check out further details in the image below: \n\nThere will also be various mas outbreaks for grass, ice, ground, and fire-type Pokémon beginning tomorrow and running through September, too, to coincide with this Tera Raid Battle series. \n\nAnd finally, you can receive a special Tracksuit apparel right now in Pokémon Scarlet and Violet by using the Mystery Gift codes below: \n\nPokémon Champions\n\nWe got another exciting look at Pokémon Champions, which is launching on Switch, iOS, and Android sometime next year. You can get the full rundown of what to expect in our story from today's presentation here. \n\nPokémon Legends: Z-A\n\nWe got a swath of information about the upcoming Pokémon Legends: Z-A, which launches Thursday, October 16, on Nintendo Switch and Switch 2 (with a separate Nintendo Switch 2 Edition), as well as two trailers. You can check out the first trailer above, and the second trailer below. For a full breakdown of everything we learned about Pokémon Legends: Z-A today, head to Game Informer's story here. \n\nAnd that's everything announced during today's Pokémon Presents! Let us know what you're most excited about in the comments below!",
        "summary": "The Pokémon Company held another Pokémon Presents direct-style presentation today, featuring new looks at upcoming games like Pokémon Legends: Z-A and Pokémon Champions, and brand-new game reveals, too. Clocking it at roughly 24 minutes, it's one of the longest Pokémon Presents ever, and there's a lot to unpack...so let's get right into it!\n\nEverything Announced During The July 2025 Pokémon Presents\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\n\n\n  \n    \n\n  \n      \n            \n\n\n      \n  \n\n\n\n\n\n\n\n\n\n\n\n2025 Pokémon World Championships\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\n\n\n  \n    \n\n  \n      \n            \n\n\n      \n  \n\n\n\n\n\n\n\n\n\n\n\nToday's Pokémon Presents began with a quick look at what to expect during the 2025 Pokémon World Championships happening next month in Anaheim, California, including details about where it will be streaming and more. Head here for a more information about that. We learned during this segment that all competitors will receive the promotional card show above: \n\nPokémon Concierge Season 2\n\n\n\n\n\n\n\n\n\n\n\n\n\t\n\n\n\n  \n    \n\n  \n      \n            \n\n\n    ",
        "url": "https://gameinformer.com/pokemon-presents/2025/07/22/everything-announced-during-july-2025s-pokemon-presents",
        "image": "https://gameinformer.com/sites/default/files/styles/thumbnail/public/2025/07/22/4de38b1c/pokemon_legends_z-a_mega_dragonite_screenshot.jpg",
        "video": null,
        "publish_date": "2025-07-22 14:45:03",
        "author": "Wesley Leblanc",
        "authors": ["Wesley Leblanc"],
        "language": "en",
        "source_country": "us",
        "sentiment": 0.628
      },
      {
        "id": 345937420,
        "title": "A new Pokemon Legends: Z-A clip teasing its seamless battling has fans more excited for the RPG than any of its actual trailers: \"This will be the best Pokemon game\"",
        "text": "Skip to main content\n\nGamesRadar+\n\nGamesRadar+\n\nGamesRadar+ The Games, Movies, TV & Comics You Love\n\nSearch GamesRadar+\n\nView Profile\n\nXbox Series X\n\nNintendo Switch\n\nNintendo Switch 2\n\nTabletop Gaming\n\nToys & Collectibles\n\nRetro Gamer\n\nNewsletters\n\nTotal Film \n\nGaming Magazines\n\nWhy subscribe?\n\nSubscribe from just £3\nTakes you closer to the games, movies and TV you love\nTry a single issue or save on a subscription\nIssues delivered straight to your door or device\n\n From£9.99Subscribe now\n\nBattlefield 6\nSDCC 2025 schedule\n\nSwitch 2 Starter Pack\n\nRecommended reading\n\nPokemon Scarlet and Violet's Switch 2 update footage shows the \"notorious frame drop lake\" running at 60fps, and fans say it might be \"the best possible advertisement\" for the new console\n\nPokemon Legends Z-A's Mega Dragonite leak finally confirmed, and it's either \"so good\" or the \"worst design for a Mega Evolution Pokemon ever\" depending on who you ask\n\nPokemon Legends Z-A: Everything we know so far about the upcoming Nintendo game\n\nPokemon Legends Z-A is making amends for Scarlet and Violet's poor fashion game, though I can't say I'm not concerned about handing a Furfrou over to a Scyther for a trim\n\nPokemon Legends: Z-A just got an October release date, and we can look forward to another Pokemon Presents stream in July\n\nNintendo finally shows gameplay footage of Pokemon Scarlet and Violet on Switch 2, and the frame rate boost is honestly a lot nicer than I expected\n\nPokemon Champions: Everything we know so far\n\nAdventure Games\n\nPokemon Legends: Z-A\n\nA new Pokemon Legends: Z-A clip teasing its seamless battling has fans more excited for the RPG than any of its actual trailers: \"This will be the best Pokemon game\" \n\nCatherine Lewis \n\n28 July 2025\n\nLegends: Z-A's real-time combat is proving to be a massive draw\n\nWhen you purchase through links on our site, we may earn an affiliate commission. Here’s how it works.\n\n(Image credit: The Pokemon Company)\n\nWe may have got a whole new look at Pokemon Legends: Z-A during last week's Pokemon Presents, but it seems like one new 28-second clip that's emerged from the RPG's Japanese website has caused more hype online than the entire previous stream. Sorry, Mega Dragonite.\n\nAs highlighted by Twitter user @palkiaorigin, tucked away on a page covering Legends: Z-A's features is a short video showing off the game's battle system. Of course, we've already seen how it works before, with battles initiated from the overworld like in Legends: Arceus, although with new real-time combat elements that make fights look a lot more reminiscent of the Pokemon anime. However, as this fan points out, the clip shows how \"seamless\" these battles are.\nIn the clip, we see the player approach a wild Binacle, with a battle starting as they send out their own Fletchling. After an attack, they then switch to their Chikorita (having clearly made the correct choice of starter Pokemon), dodge an incoming water move by running to the side, and launch a counterattack from a different angle, knocking the enemy out. As was previously revealed, bringing a wild Pokemon down to 0HP no longer instantly defeats them – there's a window where they become dizzy and you can still catch them – but as shown here, if you wait long enough, they'll simply disappear.\n\nYou may like\n\nPokemon Scarlet and Violet's Switch 2 update footage shows the \"notorious frame drop lake\" running at 60fps, and fans say it might be \"the best possible advertisement\" for the new console\n\nPokemon Legends Z-A's Mega Dragonite leak finally confirmed, and it's either \"so good\" or the \"worst design for a Mega Evolution Pokemon ever\" depending on who you ask\n\nPokemon Legends Z-A: Everything we know so far about the upcoming Nintendo game\n\nThe battles in Legends ZA are pretty seamless. pic.twitter.com/xvHkt3fajNJuly 27, 2025\n\nAs short as the video is, it's still been enough to bring out the hype from fans. \"Not even trying to glaze it, but this is legitimately the type of Pokemon game I dreamed of having as a child. Real-time combat, I can make my mon dodge!? IT LOOKS SO GOOOOOD,\" one declares, while another speculates: \"Genuinely, honestly, and unironically this will be the best Pokemon game, but probably the most divisive.\"\n\nOthers feel like this has given us a better look at what Legends: Z-A has to offer compared to its previous trailers. \"Why does this footage look more impressive than everything else they've shown,\" one says. \"This little section actually looks like what I would imagine a Gen 10 would look like with the [Switch 2] power.\"\nMeanwhile, another argues: \"Everyone saying 'this might be the best Pokemon game of all-time' after someone posted a 20-second clip on a random Sunday is funny yet fair since PLZA has had the most boring trailers of any Pokemon game ever.\"\nRegardless of how you feel about Legends: Z-A's previous trailers, I think it's safe to say that any looks at its new Xenoblade-esque combat system are appreciated – it's certainly the thing that stands out the most compared to every other entry in the series. Who knows, perhaps this might end up being the way forward instead of the regular turn-based battles we've been used to?\n\nSign up to the GamesRadar+ Newsletter\nWeekly digests, tales from the communities you love, and more\nContact me with news and offers from other Future brandsReceive email from us on behalf of our trusted partners or sponsorsBy submitting your information you agree to the Terms & Conditions and Privacy Policy and are aged 16 or over.\nFor now, be sure to check out our roundup of the best Pokemon games you can play today.\n\nSee more Nintendo Switch 2 News\n\nThe Pokemon Company\n\nNintendo Switch 2\nNintendo Switch\n\nCatherine Lewis\n\nSocial Links Navigation\nDeputy News Editor\n\nI'm GamesRadar+'s Deputy News Editor, working alongside the rest of the news team to deliver cool gaming stories that we love. After spending more hours than I can count filling The University of Sheffield's student newspaper with Pokemon and indie game content, and picking up a degree in Journalism Studies, I started my career at GAMINGbible where I worked as a journalist for over a year and a half. I then became TechRadar Gaming's news writer, where I sourced stories and wrote about all sorts of intriguing topics. In my spare time, you're sure to find me on my Nintendo Switch or PS5 playing through story-driven RPGs like Xenoblade Chronicles and Persona 5 Royal, nuzlocking old Pokemon games, or going for a Victory Royale in Fortnite.\n\nYou must confirm your public display name before commenting\n\nPlease logout and then login again, you will then be prompted to enter your display name.\n\nPokemon Scarlet and Violet's Switch 2 update footage shows the \"notorious frame drop lake\" running at 60fps, and fans say it might be \"the best possible advertisement\" for the new console\n\nPokemon Legends Z-A's Mega Dragonite leak finally confirmed, and it's either \"so good\" or the \"worst design for a Mega Evolution Pokemon ever\" depending on who you ask\n\nPokemon Legends Z-A: Everything we know so far about the upcoming Nintendo game\n\nPokemon Legends Z-A is making amends for Scarlet and Violet's poor fashion game, though I can't say I'm not concerned about handing a Furfrou over to a Scyther for a trim\n\nPokemon Legends: Z-A just got an October release date, and we can look forward to another Pokemon Presents stream in July\n\nNintendo finally shows gameplay footage of Pokemon Scarlet and Violet on Switch 2, and the frame rate boost is honestly a lot nicer than I expected\n\nLatest in Pokemon\n\nMega Dragonite's goofy wings in Pokemon Legends Z-A start to make sense when you consider one of the wildest theories in Pokemon history: \"All the Mega Pokemon are designed after either the letter X or Y\"\n\nAll Pokemon Presents 2025 Codes for Pokemon Go, Scarlet and Violet, and Legends Z-A\n\nPokemon Champions is the Pokemon Stadium 3 we deserve, and it's out in 2026\n\nPokemon Legends Z-A is making amends for Scarlet and Violet's poor fashion game, though I can't say I'm not concerned about handing a Furfrou over to a Scyther for a trim\n\n12 years later, Pokemon Legends Z-A brings back a \"forgotten, uninteresting character\" from Pokemon X and Y and puts her in charge of one of the coolest new features \n\nPokemon Legends Z-A's Mega Dragonite leak finally confirmed, and it's either \"so good\" or the \"worst design for a Mega Evolution Pokemon ever\" depending on who you ask\n\nLatest in News\n\nPedro Pascal says he's \"being honest\" when he denies that his Fantastic Four character Reed Richards will lead the Avengers in Doomsday: \"I'm not even trying to avoid spoilers\" \n\nDonkey Kong Country's DK designer is once again defending Bananza's redesign: \"I'm not sure why I even made him brown – the gorilla I based him on was gray\"\n\nRelease the Shakman Cut? Fantastic Four director shoots down hopes of a director's cut because of the amount of \"unfinished\" VFX in deleted scenes\n\nThe God of War TV show will \"emulate the tone of the game\", even if the showrunner isn't a gamer: \"My wife plays Skyrim, but I lack the muscle memory of my thumbs\"\n\nNintendo Switch 2 stock live - US and UK restocks for Ninty's latest handheld\n\nDying Light franchise director says The Beast's final mission leaves you no choice, and that's a good thing: \"You shouldn't be saying what's canon and what's not\"\n\nGAME REVIEWS\nMOVIE REVIEWS\n\nWheel World review: \"By merging Burnout Paradise and The Legend of Zelda: Breath of the Wild with pedal power, Wheel World arrives somewhere unusual and worth visiting\"\n\nWuchang: Fallen Feathers review: \"Flashy combos are impressive, but boss battle frustrations get in the way of me actually using them\"\n\nDonkey Kong Bananza review: \"Destruction isn't just a flashy gimmick for the Minecraft generation, it's one of the best inventions Nintendo has had in years\"\n\nTony Hawk's Pro Skater 3 + 4 review: \"A nostalgic, must-play hit for fans\"\n\nCollege Football 26 review: “Thanks to rivalries and dynasty, this is the greatest show on turf”\n\nThe Fantastic Four: First Steps review: \"An occasionally thrilling heroic adventure that sits safely within a B-tier MCU range\"\n\nSuperman review: \"A triumphant reinvention and a promising start for the DCU\"\n\nJurassic World Rebirth Review: \"An unscary sequel that needed a little more time in amber\"\n\nM3GAN 2.0 review: \"A bold sequel with a slightly underwhelming conclusion\"\n\n28 Years Later Review: \"Enough terror, splatter and suspense to satisfy”\n\nSquid Game season 3 review: \"A staggeringly excellent final season wraps up one of the greatest Netflix shows ever\"\n\nIronheart review: \"A relic of Marvel's content-at-all-costs era\"\n\nStar Trek: Strange New Worlds season 3 review: \"The show's most assured run of episodes to date\"\n\nDoctor Who season 2, episode 8 spoiler review: 'The Reality War' is \"a mix of the good, the bad, and the truly baffling\"\n\nDoctor Who season 2, episode 7 spoiler review: 'Wish World' is \"an exciting and ambitious\" start to the season finale, with hints of WandaVision\n\nGamesRadar+ is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.\n\nContact Future's experts\n\nTerms and conditions\n\nPrivacy policy\n\nCookies policy\n\nAdvertise with us\n\nReview guidelines\n\nWrite for us\n\nAccessibility Statement\n\nFuture Publishing Limited Quay House, The Ambury,\n\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. \n\nPlease login or signup to comment\n\nPlease wait...",
        "summary": "Legends: Z-A's real-time combat is proving to be a massive draw",
        "url": "https://www.gamesradar.com/games/pokemon/a-new-pokemon-legends-z-a-clip-teasing-its-seamless-battling-has-fans-more-excited-for-the-rpg-than-any-of-its-actual-trailers-this-will-be-the-best-pokemon-game/",
        "image": "https://cdn.mos.cms.futurecdn.net/xUpNNaun8bYgJ53p9fLmMa.jpg",
        "video": null,
        "publish_date": "2025-07-28 10:30:23",
        "author": "Catherine Lewis",
        "authors": ["Catherine Lewis"],
        "language": "en",
        "source_country": "us",
        "sentiment": 0.268
      },
      {
        "id": 346971784,
        "title": "Nintendo of America suggested giving Pikachu \"huge breasts\" during localization according to The Pokemon Company's CEO, who \"won't show those illustrations to anyone as long as I live\"",
        "text": "Skip to main content\n\nGamesRadar+\n\nGamesRadar+\n\nGamesRadar+ The Games, Movies, TV & Comics You Love\n\nSearch GamesRadar+\n\nView Profile\n\nXbox Series X\n\nNintendo Switch\n\nNintendo Switch 2\n\nTabletop Gaming\n\nToys & Collectibles\n\nRetro Gamer\n\nNewsletters\n\nTotal Film \n\nGaming Magazines\n\nWhy subscribe?\n\nSubscribe from just £3\nTakes you closer to the games, movies and TV you love\nTry a single issue or save on a subscription\nIssues delivered straight to your door or device\n\n From£9.99Subscribe now\n\nBattlefield 6\nSwitch 2 stock\nNintendo Direct\n\nSummer of Horror\n\nRecommended reading\n\nPokemon logo designer speaks up after 27 years, shares unused designs and says Nintendo gave him a month to draft one of the most iconic logos in history before Red and Blue reveal\n\nThe unauthorized Pokemon musical titled \"Balls: The Monster Catchin' Musical\" made me question everything about life and Nintendo copyright\n\nPokemon TCG Pocket pulls card art after apologizing for plagiarizing an illustration that an artist posted 4 years ago, leaving us with an unintentionally hilarious placeholder \n\nMega Dragonite's goofy wings in Pokemon Legends Z-A start to make sense when you consider one of the wildest theories in Pokemon history: \"All the Mega Pokemon are designed after either the letter X or Y\"\n\nPokemon Legends Z-A is making amends for Scarlet and Violet's poor fashion game, though I can't say I'm not concerned about handing a Furfrou over to a Scyther for a trim\n\nAction RPGs\n\"I bet they didn't crunch this in a year or 2\": As Switch 2 gives Pokemon Scarlet and Violet a needed FPS boost, fans blast GameFreak one last time as it unveils its gorgeous new action RPG\n\nAs Donkey Kong Bananza reveals full-blown voice acting, Pokemon fans are wondering when they will be spared from the awkward silences\n\nAdventure Games\n\nPokemon Red/Blue\n\nNintendo of America suggested giving Pikachu \"huge breasts\" during localization according to The Pokemon Company's CEO, who \"won't show those illustrations to anyone as long as I live\"\n\nScott McCrae \n\n31 July 2025\n\n\"Pikachu was changed into a character shaped like a kind of a tabby cat\"\n\nWhen you purchase through links on our site, we may earn an affiliate commission. Here’s how it works.\n\n(Image credit: The Pokemon Company)\n\nApparently Nintendo of America wanted to give Pikachu… and I quote… \"huge breasts\" during the localization of Pokemon.\n\nLocalization is a delicate process, some things that make sense in one region may not translate to another, not even on the actual act of translation either. A prominent example is Kirby looking pissed on the cover of every game for the American box art but being his usual cute Kirby self in Japan, or the Crash Bandicoot covers in Japan which were wildly different from the by comparison edgier US design. And turns out Pokemon had a redesign suggested that may have changed the way we see the games forever.\nIn an interview with Nintendo from around the launch of Pokemon Gold and Silver (uncovered by Game*Spark and translated by Automaton), The Pokemon Company CEO Tsunekazu Ishihara said: \"When I first showed Pokemon to them, they told me it was too cute. The staff at Nintendo of America then suggested their own designs for the characters – I won't show those illustrations to anyone as long as I live.\"\n\nYou may like\n\nPokemon logo designer speaks up after 27 years, shares unused designs and says Nintendo gave him a month to draft one of the most iconic logos in history before Red and Blue reveal\n\nThe unauthorized Pokemon musical titled \"Balls: The Monster Catchin' Musical\" made me question everything about life and Nintendo copyright\n\nPokemon TCG Pocket pulls card art after apologizing for plagiarizing an illustration that an artist posted 4 years ago, leaving us with an unintentionally hilarious placeholder \n\nIshihara added that \"they kind of looked like the characters from the Cats musical. So, for example, Pikachu was changed into a character shaped like a kind of a tabby cat with huge breasts.\"\n\nWhen asked if it was akin to women who do Pikachu cosplay at conventions, Ishihara said: \"They presented that kind of design to us for real. I thought it was interesting, in a sense of appreciating such cultural differences. However, I didn't want to compete in the [overseas] market with that kind of thing.\"\nPokemon already caused all manner of controversy when they first arrived, with some even calling it satanic, so was the world ready to see Pikachu with breasts? Were other Pokemon going to get human anatomy added onto them? What exactly is Diglett? These are the questions we have avoided by The Pokemon Company standing its ground and saying no to a stacked Pikachu, and we're better off for it.\nPokemon TCG Pocket pulls card art after apologizing for plagiarizing an illustration that an artist posted 4 years ago, leaving us with an unintentionally hilarious placeholder.\n\nSign up to the GamesRadar+ Newsletter\nWeekly digests, tales from the communities you love, and more\nContact me with news and offers from other Future brandsReceive email from us on behalf of our trusted partners or sponsorsBy submitting your information you agree to the Terms & Conditions and Privacy Policy and are aged 16 or over.\n\nSee more Nintendo Switch 2 News\n\nThe Pokemon Company\n\nNintendo Switch 2\nNintendo Switch\n\nScott McCrae\n\nSocial Links Navigation\nContributor\n\nScott has been freelancing for over three years across a number of different gaming publications, first appearing on GamesRadar+ in 2024. He has also written for the likes of PC Gamer, Eurogamer, VG247, Play, TechRadar, and others. He's typically rambling about Metal Gear Solid, God Hand, or any other PS2-era titles that rarely (if ever) get sequels.\n\nYou must confirm your public display name before commenting\n\nPlease logout and then login again, you will then be prompted to enter your display name.\n\nPokemon logo designer speaks up after 27 years, shares unused designs and says Nintendo gave him a month to draft one of the most iconic logos in history before Red and Blue reveal\n\nThe unauthorized Pokemon musical titled \"Balls: The Monster Catchin' Musical\" made me question everything about life and Nintendo copyright\n\nPokemon TCG Pocket pulls card art after apologizing for plagiarizing an illustration that an artist posted 4 years ago, leaving us with an unintentionally hilarious placeholder \n\nMega Dragonite's goofy wings in Pokemon Legends Z-A start to make sense when you consider one of the wildest theories in Pokemon history: \"All the Mega Pokemon are designed after either the letter X or Y\"\n\nPokemon Legends Z-A is making amends for Scarlet and Violet's poor fashion game, though I can't say I'm not concerned about handing a Furfrou over to a Scyther for a trim\n\n\"I bet they didn't crunch this in a year or 2\": As Switch 2 gives Pokemon Scarlet and Violet a needed FPS boost, fans blast GameFreak one last time as it unveils its gorgeous new action RPG\n\nLatest in Pokemon\n\nPokemon TCG Pocket pulls card art after apologizing for plagiarizing an illustration that an artist posted 4 years ago, leaving us with an unintentionally hilarious placeholder \n\nA new Pokemon Legends: Z-A clip teasing its seamless battling has fans more excited for the RPG than any of its actual trailers: \"This will be the best Pokemon game\" \n\nMega Dragonite's goofy wings in Pokemon Legends Z-A start to make sense when you consider one of the wildest theories in Pokemon history: \"All the Mega Pokemon are designed after either the letter X or Y\"\n\nAll Pokemon Presents 2025 Codes for Pokemon Go, Scarlet and Violet, and Legends Z-A\n\nPokemon Champions is the Pokemon Stadium 3 we deserve, and it's out in 2026\n\nPokemon Legends Z-A is making amends for Scarlet and Violet's poor fashion game, though I can't say I'm not concerned about handing a Furfrou over to a Scyther for a trim\n\nLatest in News\n\nSquare Enix hasn't abandoned turn-based JRPGs, but the creators of Octopath Traveler and Bravely Default have followed Final Fantasy with a new action RPG – still in the gorgeous HD-2D style\n\nThe first new console Katamari Damacy in 14 years is arriving this October, and Nintendo is a coward for cutting this very \"nice\" 69 joke from the Direct announcement\n\nAfter reportedly turning it down, Jeremy Renner says he's \"sure we'll end up doing\" Hawkeye season 2: \"My body's getting ready\"\n\nSwitch 2 Direct reveals new Hyrule Warriors: Age of Imprisonment trailer, but there's still no release date aside from \"this winter\" as Nintendo says it'll \"share more information\" later\n\nOh hey, Square Enix announced a turn-based JRPG: Octopath Traveler 0 is coming this year and it looks like it's added 8-character fights and some Suikoden to the mix\n\nPersona 3 Reload is coming to Switch 2 in October, finally confirming what we've expected since it was announced\n\nGAME REVIEWS\nMOVIE REVIEWS\n\nNinja Gaiden: Ragebound review: \"Absolutely proves Ninja Gaiden deserved to be revived – I've never been happier to be right\"\n\nGrounded 2 review: \"I'm already having terrific fun thanks to ant buggies and a massive new park to explore, even if this sequel is slightly safe\"\n\nTales of the Shire review: \"As a long-time Tolkien fan, I'm both pleasantly surprised and slightly frustrated at what should've been my dream Lord of the Rings game\"\n\nWheel World review: \"By merging Burnout Paradise and The Legend of Zelda: Breath of the Wild with pedal power, Wheel World arrives somewhere unusual and worth visiting\"\n\nWuchang: Fallen Feathers review: \"Flashy combos are impressive, but boss battle frustrations get in the way of me actually using them\"\n\nThe Fantastic Four: First Steps review: \"An occasionally thrilling heroic adventure that sits safely within a B-tier MCU range\"\n\nSuperman review: \"A triumphant reinvention and a promising start for the DCU\"\n\nJurassic World Rebirth Review: \"An unscary sequel that needed a little more time in amber\"\n\nM3GAN 2.0 review: \"A bold sequel with a slightly underwhelming conclusion\"\n\n28 Years Later Review: \"Enough terror, splatter and suspense to satisfy”\n\nSquid Game season 3 review: \"A staggeringly excellent final season wraps up one of the greatest Netflix shows ever\"\n\nIronheart review: \"A relic of Marvel's content-at-all-costs era\"\n\nStar Trek: Strange New Worlds season 3 review: \"The show's most assured run of episodes to date\"\n\nDoctor Who season 2, episode 8 spoiler review: 'The Reality War' is \"a mix of the good, the bad, and the truly baffling\"\n\nDoctor Who season 2, episode 7 spoiler review: 'Wish World' is \"an exciting and ambitious\" start to the season finale, with hints of WandaVision\n\nGamesRadar+ is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.\n\nContact Future's experts\n\nTerms and conditions\n\nPrivacy policy\n\nCookies policy\n\nAdvertise with us\n\nReview guidelines\n\nWrite for us\n\nAccessibility Statement\n\nFuture Publishing Limited Quay House, The Ambury,\n\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. \n\nPlease login or signup to comment\n\nPlease wait...",
        "summary": "\"Pikachu was changed into a character shaped like a kind of a tabby cat\"",
        "url": "https://www.gamesradar.com/games/pokemon/nintendo-of-america-suggested-giving-pikachu-huge-breasts-during-localization-according-to-the-pokemon-companys-ceo-who-wont-show-those-illustrations-to-anyone-as-long-as-i-live/",
        "image": "https://cdn.mos.cms.futurecdn.net/owBMk3iyQGfyjjcmMaAME5.jpg",
        "video": null,
        "publish_date": "2025-07-31 14:27:00",
        "author": "Scott McCrae",
        "authors": ["Scott McCrae"],
        "language": "en",
        "source_country": "us",
        "sentiment": 0.008
      },
      {
        "id": 341941620,
        "title": "How to Watch Pokemon Presents 2025 for Legends: Z-A, TCG Pocket and More",
        "text": "It's that time again, trainers: Grab your Pokedex and get ready to catch some new pocket monsters, because we're about to hear everything about the latest developments in the world of Pokemon.\n\nThe Pokemon Presents July 2025 stream is the first one since Pokemon Day in February. That stream ended up being pretty massive, featuring game announcements and content updates that we heard whispers about from GameFreak's infamous 2024 data breach.\n\nWhile we don't know what to expect this time around, it's safe to assume that we'll hear about the next mainline games, mobile titles, live service updates and more.\n\nHere's how you can watch the upcoming Pokemon Direct -- and what you can expect to see once you tune into the stream.\n\nHow to watch July 2025's Pokemon Presents stream\n\nThe upcoming Pokemon Presents stream will take place on Tuesday, July 22 at 6 a.m. PT (9 a.m. ET, 2 p.m. BST, 11 p.m. AEST). The stream will go live on the official Pokemon YouTube channel. We don't know exactly how long the event will run, but previous Pokemon Presents streams have ranged from 10 to 20 minutes long, depending on how many announcements are prepared for the stream.\n\nWhat can you expect from Pokemon Presents July 2025?\n\nThis Pokemon Presents stream is positioned at a strange time -- Pokemon Legends: Z-A for the Nintendo Switch 2 has already been announced and we have plenty of info and gameplay footage available for that game. We might still get a segment that expands on new gameplay mechanics and Pokemon that players will be able to find in this version of the Kalos region, especially Mega forms that we haven't yet seen.\n\nThe official Pokemon Company Japan X account teased this Pokemon Direct with a rather foreboding photo of Pikachu standing in front of some DJ equipment, so we might hear about a Pokemon rhythm game. Between that, New Pokemon Snap and the return of Mystery Dungeon, I'm loving the reintroduction of bizarre offshoot games.\n\nIt's also possible that generation 10 will be announced during the presentation. There are usually three years between mainline Pokemon titles, and Pokemon Scarlet and Violet released in 2022. Unless GameFreak is looking to polish the next big games with some extra development time, we're probably due to hear about the next generation of Pokemon games extremely soon.\n\nPokemon Day 2025 featured an announcement for Pokemon Champions, a dedicated Pokemon battling game, but we haven't heard much about the game since. We could very well get an update about that game during this stream, explaining more about how the game will integrate the series' long list of battle mechanics and giving us a better idea of when we'll see a full release.\n\nOtherwise, the backbone of this presentation will very likely be composed of routine updates and new features for Pokemon mobile and live service games. We can expect to hear about new Pokemon coming to Pokemon Cafe Mix, Pokemon Masters Ex and Pokemon Sleep, with the potential for new playable Pokemon to be revealed for Pokemon Unite.\n\nWith Pokemon Go changing hands from Niantic to Scopely, it's possible that the extremely popular AR game will have announcements that shake up core gameplay features for Pokemon trainers worldwide. The recent addition of the Gold Bottle Cap was already a massive change for the status quo.\n\nI'd be willing to bet that the next Pokemon TCG Pocket set will be revealed during this Pokemon Presents as well. New expansions are usually teased at the end of each month, which lines up with this stream. The last Pokemon Presents included info about a massive set expansion, too, so the precedent is already set for this reveal.\n\nIf you're excited for non-gaming Pokemon content, there's also a chance we'll see some Pokemon Concierge during the Pokemon Presents July stream. The second season for this slice-of-life Pokemon hotel series is set to release on Netflix in September, so we might catch a scene or two teasing the show and get an official release date.",
        "summary": "July's Pokemon Presents stream will likely provide updates for Pokemon live service games, mainline titles and the upcoming Netflix series.",
        "url": "https://www.cnet.com/tech/gaming/how-to-watch-pokemon-presents-2025-for-legends-z-a-tcg-pocket-and-more/",
        "image": "https://www.cnet.com/a/img/resize/63c290fc5f81451fcd08e7b87890aa5ad9b28717/hub/2025/07/15/0daddc20-bd00-4b62-ad1c-08687dab8a8c/pokemon-presents-dj-pikachu-promo-hed.jpg?auto=webp&fit=crop&height=675&width=1200",
        "video": null,
        "publish_date": "2025-07-15 20:20:00",
        "author": "Tyler Graham",
        "authors": ["Tyler Graham"],
        "language": "en",
        "category": "sports",
        "source_country": "US",
        "sentiment": 0.017
      },
      {
        "id": 344170686,
        "title": "Pokemon reveals new looks at two adorable new animated shows: an Aardman collaboration and the long-awaited season 2 of a fan-favorite Netflix series",
        "text": "Skip to main content\n\nGames Radar\n\nRetro Gamer\n\nTotal Film \nThe smarter take on movies\n\nSearch GamesRadar+\n\nView Profile\n\nXbox Series X\n\nNintendo Switch\n\nNintendo Switch 2\n\nTabletop Gaming\n\nToys & Collectibles\n\nRetro Gamer\n\nNewsletters\n\nGaming Magazines\n\nWhy subscribe?\n\nSubscribe from just £3\nTakes you closer to the games, movies and TV you love\nTry a single issue or save on a subscription\nIssues delivered straight to your door or device\n\n From£9.99Subscribe now\n\nBest Netflix Movies\nBest movies on Disney Plus\nMovie Release Dates\nBest Netflix Shows\n\nRecommended reading\n\nAnime Shows\nHow to watch Pokemon in order: a complete guide to the TV show and movies\n\nAnime Movies\nGotta watch 'em all: The best Pokémon movies from your childhood are available for free on YouTube for a \"limited time\"\n\nA new Pokemon puzzle game got shadow launched during today's Presents stream, and it reminds me of all the iPhone games I used to play as a teenager\n\nPokemon Legends: Z-A just got an October release date, and we can look forward to another Pokemon Presents stream in July\n\nNintendo finally shows gameplay footage of Pokemon Scarlet and Violet on Switch 2, and the frame rate boost is honestly a lot nicer than I expected\n\nPokemon Black and White fans are back with the remake hopium as Pokemon posts a teaser ahead of its upcoming Presents stream: \"The room is completely black and white\"\n\nPokemon Scarlet and Violet's free Switch 2 update promises to steal hundreds more hours from me as shiny hunting looks easier than ever with more wild encounters\n\nEntertainment\n\nAnimated Shows\n\nPokemon Concierge \n\nPokemon reveals new looks at two adorable new animated shows: an Aardman collaboration and the long-awaited season 2 of a fan-favorite Netflix series\n\nEmily Garbutt \n\n22 July 2025\n\nThe first trailer for Pokemon Concierge season 2 is here, along with a teaser for a new Aardman series\n\nWhen you purchase through links on our site, we may earn an affiliate commission. Here’s how it works.\n\n(Image credit: Netflix)\n\nPokemon has unveiled new looks at two animated shows, and both of them look completely adorable.\n\nAs part of the Pokemon Presents showcase today (July 22), the first look at Pokemon Tales: The Misadventures of Sirfetch'd and Pichu, a new series made with Wallace and Gromit animation studio Aardman, was unveiled, along with some updates on Netflix's Pokemon Concierge season 2.\nThe collaboration between Pokemon and Aardman was announced last year, but now we have a glimpse at the two titular characters causing havoc in a new brief teaser while a Wooloo minds its business in the foreground. You can watch it below.\n\nYou may like\n\nHow to watch Pokemon in order: a complete guide to the TV show and movies\n\nGotta watch 'em all: The best Pokémon movies from your childhood are available for free on YouTube for a \"limited time\"\n\nA new Pokemon puzzle game got shadow launched during today's Presents stream, and it reminds me of all the iPhone games I used to play as a teenager\n\nPokemon Tales The Misadventures of Sirfetch'd & Pichu Animation Teaser - YouTube\n\n\"We'll be putting some very special Pokémon front and centre, as the heroes of our show and it will be set in a region that is very close to our hearts,\" Aardman creative director Peter Lord said during the showcase. \"It will give a unique look at the Pokémon world, told from the perspective of Pokémon with the signature sense of Aardman character and comedy and craft.\"\n\nMeanwhile, Pokemon Concierge season 2 finally has a first trailer and a release date. In the new teaser, Haru encounters new guests (including Sealeo, who seems to be causing its fair share of mischief) – and her ex-boyfriend. But it seems like things are only looking up for her. \"Moving here helped a lot,\" she says. \"Working actually makes me happy. And I can work harder too.\" Check out the full clip below.\n\nPokémon Concierge | New Episodes Trailer | Netflix - YouTube\n\nThe first season hit Netflix in December 2023 and follows Haru, a new employee of the Pokemon Resort, who's trying her best to settle into her new role and make sure all her guests have the best, most relaxing time possible.\nPer the official synopsis, \"as Haru figures out how to make her guests happy, she ends up discovering a new side to herself.\" Psyduck, Pikachu, Eevee, Dragonite, and Magikarp were among the familiar faces that made an appearance in season 1, and the new season is set to see Shinx, Corphish, and Arcanine enter the fray.\nPokemon Concierge season 2 arrives on Netflix on September 4. In the meantime, fill out your watchlist with our picks of the other best Netflix shows streaming now.\n\nSee more TV Shows News\n\nStreaming Services\n\nEmily Garbutt\n\nSocial Links Navigation\nEntertainment Writer\n\nI’m an Entertainment Writer here at GamesRadar+, covering everything film and TV-related across the Total Film and SFX sections. I help bring you all the latest news and also the occasional feature too. I’ve previously written for publications like HuffPost and i-D after getting my NCTJ Diploma in Multimedia Journalism. \n\nYou must confirm your public display name before commenting\n\nPlease logout and then login again, you will then be prompted to enter your display name.\n\nHow to watch Pokemon in order: a complete guide to the TV show and movies\n\nGotta watch 'em all: The best Pokémon movies from your childhood are available for free on YouTube for a \"limited time\"\n\nA new Pokemon puzzle game got shadow launched during today's Presents stream, and it reminds me of all the iPhone games I used to play as a teenager\n\nPokemon Legends: Z-A just got an October release date, and we can look forward to another Pokemon Presents stream in July\n\nNintendo finally shows gameplay footage of Pokemon Scarlet and Violet on Switch 2, and the frame rate boost is honestly a lot nicer than I expected\n\nPokemon Black and White fans are back with the remake hopium as Pokemon posts a teaser ahead of its upcoming Presents stream: \"The room is completely black and white\"\n\nLatest in Animated Shows\n\nFuturama returns with season 13 later this summer, and this first look has me laughing already\n\nInvincible season 5 is officially happening but, wait, there's more: voice recording is complete and the Amazon superhero show is teasing a mysterious \"redacted\" cast newcomer\n\nI've seen all 13 seasons time and time again, and these are the best King of the Hill episodes\n\nKing of the Hill Revival has finally revealed what grown-up Bobby’s job is, and we feel like proud parents over here \n\nSouth Park fans threaten to cancel their Paramount+ subscriptions after the show was pulled from streaming outside the US: \"How does one go about setting Paramount on fire?\"\n\nKing of the Hill revival's first trailer shows an unrecognizable Bill, more of Bobby's restaurant, and Hank Hill trying to keep up with an ever-changing Arlen\n\nLatest in News\n\nEA drops a Battlefield 6 reveal trailer countdown for July 24: \"Prepare for the ultimate all-out warfare experience\"\n\nLast year’s goriest slasher movie is getting a sequel, with the new horror movie set to begin filming just in time for Halloween\n\nIn some of the year's best Twitch content, Peak devs infiltrate streamer lobbies and possess the unholy plush BingBong: \"Sentient BingBong you are so special to me\"\n\n12 years later, Pokemon Legends Z-A brings back a \"forgotten, uninteresting character\" from Pokemon X and Y and puts her in charge of one of the coolest new features \n\nEveryone's favorite Wonder Woman fancast has joined Sinners star Michael B. Jordan's Thomas Crown Affair remake\n\nPokemon Legends Z-A's Mega Dragonite leak finally confirmed, and it's either \"so good\" or the \"worst design for a Mega Evolution Pokemon ever\" depending on who you ask\n\nGAME REVIEWS\nMOVIE REVIEWS\n\nDonkey Kong Bananza Review: \"Destruction isn't just a flashy gimmick for the Minecraft generation, it's one of the best inventions Nintendo has had in years\"\n\nTony Hawk's Pro Skater 3 + 4 review: \"A nostalgic, must-play hit for fans\"\n\nCollege Football 26 review: “Thanks to rivalries and dynasty, this is the greatest show on turf”\n\nMecha Break review: \"This mech battler makes up for lacking customization with a varied roster that lets me live out my Evangelion fantasy\"\n\nDeath Stranding 2: On the Beach review: \"This tarpunk delivery epic is more Metal Gear Solid than ever, for better and worse\"\n\nSuperman review: \"A triumphant reinvention and a promising start for the DCU\"\n\nJurassic World Rebirth Review: \"An unscary sequel that needed a little more time in amber\"\n\nM3GAN 2.0 review: \"A bold sequel with a slightly underwhelming conclusion\"\n\n28 Years Later Review: \"Enough terror, splatter and suspense to satisfy”\n\nPredator: Killer of Killers review: \"Great characters, thrilling action, and gorgeous Arcane-esque animation\"\n\nSquid Game season 3 review: \"A staggeringly excellent final season wraps up one of the greatest Netflix shows ever\"\n\nIronheart review: \"A relic of Marvel's content-at-all-costs era\"\n\nStar Trek: Strange New Worlds season 3 review: \"The show's most assured run of episodes to date\"\n\nDoctor Who season 2, episode 8 spoiler review: 'The Reality War' is \"a mix of the good, the bad, and the truly baffling\"\n\nDoctor Who season 2, episode 7 spoiler review: 'Wish World' is \"an exciting and ambitious\" start to the season finale, with hints of WandaVision\n\nGamesRadar+ is part of Future plc, an international media group and leading digital publisher. Visit our corporate site.\n\nContact Future's experts\n\nTerms and conditions\n\nPrivacy policy\n\nCookies policy\n\nAdvertise with us\n\nReview guidelines\n\nWrite for us\n\nAccessibility Statement\n\nFuture Publishing Limited Quay House, The Ambury,\n\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885. \n\nPlease login or signup to comment\n\nPlease wait...",
        "summary": "The first trailer for Pokemon Concierge season 2 is here, along with a teaser for a new Aardman series",
        "url": "https://www.gamesradar.com/entertainment/animation-shows/pokemon-reveals-new-looks-at-two-adorable-new-animated-shows-an-aardman-collaboration-and-the-long-awaited-season-2-of-a-fan-favorite-netflix-series/",
        "image": "https://cdn.mos.cms.futurecdn.net/w34xzJLGmWVoYETWRLbUAG.jpg",
        "video": null,
        "publish_date": "2025-07-22 15:56:03",
        "author": "Emily Garbutt",
        "authors": ["Emily Garbutt"],
        "language": "en",
        "source_country": "us",
        "sentiment": 0.617
      }
    ]
  }
}
